; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depotprob1212) (:domain depots)
(:objects
	depot0 - Depot
	distributor0 distributor1 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 - Crate
	hoist0 hoist1 hoist2 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate4)
	(at pallet1 distributor0)
	(clear crate8)
	(at pallet2 distributor1)
	(clear crate9)
	(at truck0 depot0)
	(at truck1 distributor0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor1)
	(on crate0 pallet2)
	(at crate1 depot0)
	(on crate1 pallet0)
	(at crate2 distributor1)
	(on crate2 crate0)
	(at crate3 depot0)
	(on crate3 crate1)
	(at crate4 depot0)
	(on crate4 crate3)
	(at crate5 distributor1)
	(on crate5 crate2)
	(at crate6 distributor0)
	(on crate6 pallet1)
	(at crate7 distributor0)
	(on crate7 crate6)
	(at crate8 distributor0)
	(on crate8 crate7)
	(at crate9 distributor1)
	(on crate9 crate5)
)

(:goal (and
		(on crate0 crate5)
		(on crate1 pallet1)
		(on crate2 crate0)
		(on crate3 pallet2)
		(on crate4 crate6)
		(on crate5 crate4)
		(on crate6 crate9)
		(on crate7 crate1)
		(on crate8 crate3)
		(on crate9 pallet0)
	)
))

; plan
1. (lift hoist1 crate8 crate7 distributor0)
   deleted: (at crate8 distributor0) (available hoist1) (on crate8 crate7) (clear crate8)
   added: (lifting hoist1 crate8) (clear crate7)
   goals met: 1 of 10
2. (load hoist1 crate8 truck1 distributor0)
   deleted: (lifting hoist1 crate8)
   added: (in crate8 truck1) (available hoist1)
   goals met: 1 of 10
3. (lift hoist1 crate7 crate6 distributor0)
   deleted: (at crate7 distributor0) (available hoist1) (on crate7 crate6) (clear crate7)
   added: (lifting hoist1 crate7) (clear crate6)
   goals met: 1 of 10
4. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   goals met: 1 of 10
5. (lift hoist2 crate9 crate5 distributor1)
   deleted: (at crate9 distributor1) (available hoist2) (on crate9 crate5) (clear crate9)
   added: (lifting hoist2 crate9) (clear crate5)
   goals met: 1 of 10
6. (load hoist2 crate9 truck0 distributor1)
   deleted: (lifting hoist2 crate9)
   added: (in crate9 truck0) (available hoist2)
   goals met: 1 of 10
7. (lift hoist0 crate4 crate3 depot0)
   deleted: (at crate4 depot0) (available hoist0) (on crate4 crate3) (clear crate4)
   added: (lifting hoist0 crate4) (clear crate3)
   goals met: 1 of 10
8. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 1 of 10
9. (load hoist0 crate4 truck1 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck1) (available hoist0)
   goals met: 1 of 10
10. (lift hoist0 crate3 crate1 depot0)
   deleted: (at crate3 depot0) (available hoist0) (on crate3 crate1) (clear crate3)
   added: (lifting hoist0 crate3) (clear crate1)
   goals met: 1 of 10
11. (load hoist0 crate3 truck1 depot0)
   deleted: (lifting hoist0 crate3)
   added: (in crate3 truck1) (available hoist0)
   goals met: 1 of 10
12. (lift hoist0 crate1 pallet0 depot0)
   deleted: (at crate1 depot0) (available hoist0) (on crate1 pallet0) (clear crate1)
   added: (lifting hoist0 crate1) (clear pallet0)
   goals met: 1 of 10
13. (load hoist0 crate1 truck1 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck1) (available hoist0)
   goals met: 1 of 10
14. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 1 of 10
15. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   goals met: 1 of 10
16. (unload hoist0 crate9 truck0 depot0)
   deleted: (available hoist0) (in crate9 truck0)
   added: (lifting hoist0 crate9)
   goals met: 1 of 10
17. (drop hoist0 crate9 pallet0 depot0)
   deleted: (lifting hoist0 crate9) (clear pallet0)
   added: (at crate9 depot0) (available hoist0) (on crate9 pallet0) (clear crate9)
   goals met: 2 of 10
18. (unload hoist2 crate3 truck1 distributor1)
   deleted: (available hoist2) (in crate3 truck1)
   added: (lifting hoist2 crate3)
   goals met: 2 of 10
19. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 2 of 10
20. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 2 of 10
21. (unload hoist0 crate4 truck1 depot0)
   deleted: (available hoist0) (in crate4 truck1)
   added: (lifting hoist0 crate4)
   goals met: 2 of 10
22. (drop hoist2 crate3 crate5 distributor1)
   deleted: (lifting hoist2 crate3) (clear crate5)
   added: (at crate3 distributor1) (available hoist2) (on crate3 crate5) (clear crate3)
   goals met: 2 of 10
23. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 2 of 10
24. (unload hoist2 crate8 truck1 distributor1)
   deleted: (available hoist2) (in crate8 truck1)
   added: (lifting hoist2 crate8)
   goals met: 2 of 10
25. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 2 of 10
26. (load hoist0 crate4 truck0 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck0) (available hoist0)
   goals met: 2 of 10
27. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   goals met: 2 of 10
28. (drop hoist1 crate7 crate6 distributor0)
   deleted: (lifting hoist1 crate7) (clear crate6)
   added: (at crate7 distributor0) (available hoist1) (on crate7 crate6) (clear crate7)
   goals met: 2 of 10
29. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 2 of 10
30. (unload hoist0 crate1 truck1 depot0)
   deleted: (available hoist0) (in crate1 truck1)
   added: (lifting hoist0 crate1)
   goals met: 2 of 10
31. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 2 of 10
32. (lift hoist1 crate7 crate6 distributor0)
   deleted: (at crate7 distributor0) (available hoist1) (on crate7 crate6) (clear crate7)
   added: (lifting hoist1 crate7) (clear crate6)
   goals met: 2 of 10
33. (load hoist1 crate7 truck1 distributor0)
   deleted: (lifting hoist1 crate7)
   added: (in crate7 truck1) (available hoist1)
   goals met: 2 of 10
34. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 2 of 10
35. (load hoist0 crate1 truck1 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck1) (available hoist0)
   goals met: 2 of 10
36. (unload hoist0 crate7 truck1 depot0)
   deleted: (available hoist0) (in crate7 truck1)
   added: (lifting hoist0 crate7)
   goals met: 2 of 10
37. (lift hoist1 crate6 pallet1 distributor0)
   deleted: (at crate6 distributor0) (available hoist1) (on crate6 pallet1) (clear crate6)
   added: (lifting hoist1 crate6) (clear pallet1)
   goals met: 2 of 10
38. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 2 of 10
39. (load hoist1 crate6 truck1 distributor0)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck1) (available hoist1)
   goals met: 2 of 10
40. (unload hoist1 crate1 truck1 distributor0)
   deleted: (available hoist1) (in crate1 truck1)
   added: (lifting hoist1 crate1)
   goals met: 2 of 10
41. (drop hoist1 crate1 pallet1 distributor0)
   deleted: (lifting hoist1 crate1) (clear pallet1)
   added: (at crate1 distributor0) (available hoist1) (on crate1 pallet1) (clear crate1)
   goals met: 3 of 10
42. (unload hoist1 crate6 truck1 distributor0)
   deleted: (available hoist1) (in crate6 truck1)
   added: (lifting hoist1 crate6)
   goals met: 3 of 10
43. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 3 of 10
44. (load hoist0 crate7 truck1 depot0)
   deleted: (lifting hoist0 crate7)
   added: (in crate7 truck1) (available hoist0)
   goals met: 3 of 10
45. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 3 of 10
46. (load hoist1 crate6 truck1 distributor0)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck1) (available hoist1)
   goals met: 3 of 10
47. (unload hoist1 crate7 truck1 distributor0)
   deleted: (available hoist1) (in crate7 truck1)
   added: (lifting hoist1 crate7)
   goals met: 3 of 10
48. (drop hoist1 crate7 crate1 distributor0)
   deleted: (lifting hoist1 crate7) (clear crate1)
   added: (at crate7 distributor0) (available hoist1) (on crate7 crate1) (clear crate7)
   goals met: 4 of 10
49. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 4 of 10
50. (unload hoist0 crate6 truck1 depot0)
   deleted: (available hoist0) (in crate6 truck1)
   added: (lifting hoist0 crate6)
   goals met: 4 of 10
51. (drop hoist0 crate6 crate9 depot0)
   deleted: (lifting hoist0 crate6) (clear crate9)
   added: (at crate6 depot0) (available hoist0) (on crate6 crate9) (clear crate6)
   goals met: 5 of 10
52. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   goals met: 5 of 10
53. (unload hoist0 crate4 truck0 depot0)
   deleted: (available hoist0) (in crate4 truck0)
   added: (lifting hoist0 crate4)
   goals met: 5 of 10
54. (drop hoist0 crate4 crate6 depot0)
   deleted: (lifting hoist0 crate4) (clear crate6)
   added: (at crate4 depot0) (available hoist0) (on crate4 crate6) (clear crate4)
   goals met: 6 of 10
55. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 6 of 10
56. (load hoist2 crate8 truck1 distributor1)
   deleted: (lifting hoist2 crate8)
   added: (in crate8 truck1) (available hoist2)
   goals met: 6 of 10
57. (lift hoist2 crate3 crate5 distributor1)
   deleted: (at crate3 distributor1) (available hoist2) (on crate3 crate5) (clear crate3)
   added: (lifting hoist2 crate3) (clear crate5)
   goals met: 6 of 10
58. (load hoist2 crate3 truck1 distributor1)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck1) (available hoist2)
   goals met: 6 of 10
59. (lift hoist2 crate5 crate2 distributor1)
   deleted: (at crate5 distributor1) (available hoist2) (on crate5 crate2) (clear crate5)
   added: (lifting hoist2 crate5) (clear crate2)
   goals met: 6 of 10
60. (load hoist2 crate5 truck1 distributor1)
   deleted: (lifting hoist2 crate5)
   added: (in crate5 truck1) (available hoist2)
   goals met: 6 of 10
61. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   goals met: 6 of 10
62. (unload hoist0 crate5 truck1 depot0)
   deleted: (available hoist0) (in crate5 truck1)
   added: (lifting hoist0 crate5)
   goals met: 6 of 10
63. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 6 of 10
64. (drop hoist0 crate5 crate4 depot0)
   deleted: (lifting hoist0 crate5) (clear crate4)
   added: (at crate5 depot0) (available hoist0) (on crate5 crate4) (clear crate5)
   goals met: 7 of 10
65. (unload hoist1 crate3 truck1 distributor0)
   deleted: (available hoist1) (in crate3 truck1)
   added: (lifting hoist1 crate3)
   goals met: 7 of 10
66. (drop hoist1 crate3 crate7 distributor0)
   deleted: (lifting hoist1 crate3) (clear crate7)
   added: (at crate3 distributor0) (available hoist1) (on crate3 crate7) (clear crate3)
   goals met: 7 of 10
67. (unload hoist1 crate8 truck1 distributor0)
   deleted: (available hoist1) (in crate8 truck1)
   added: (lifting hoist1 crate8)
   goals met: 7 of 10
68. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 7 of 10
69. (lift hoist2 crate2 crate0 distributor1)
   deleted: (at crate2 distributor1) (available hoist2) (on crate2 crate0) (clear crate2)
   added: (lifting hoist2 crate2) (clear crate0)
   goals met: 6 of 10
70. (load hoist2 crate2 truck1 distributor1)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck1) (available hoist2)
   goals met: 6 of 10
71. (lift hoist2 crate0 pallet2 distributor1)
   deleted: (at crate0 distributor1) (available hoist2) (on crate0 pallet2) (clear crate0)
   added: (lifting hoist2 crate0) (clear pallet2)
   goals met: 6 of 10
72. (load hoist2 crate0 truck1 distributor1)
   deleted: (lifting hoist2 crate0)
   added: (in crate0 truck1) (available hoist2)
   goals met: 6 of 10
73. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   goals met: 6 of 10
74. (unload hoist0 crate0 truck1 depot0)
   deleted: (available hoist0) (in crate0 truck1)
   added: (lifting hoist0 crate0)
   goals met: 6 of 10
75. (drop hoist0 crate0 crate5 depot0)
   deleted: (lifting hoist0 crate0) (clear crate5)
   added: (at crate0 depot0) (available hoist0) (on crate0 crate5) (clear crate0)
   goals met: 7 of 10
76. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   goals met: 7 of 10
77. (unload hoist0 crate2 truck1 depot0)
   deleted: (available hoist0) (in crate2 truck1)
   added: (lifting hoist0 crate2)
   goals met: 7 of 10
78. (drop hoist0 crate2 crate0 depot0)
   deleted: (lifting hoist0 crate2) (clear crate0)
   added: (at crate2 depot0) (available hoist0) (on crate2 crate0) (clear crate2)
   goals met: 8 of 10
79. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   goals met: 8 of 10
80. (load hoist1 crate8 truck0 distributor0)
   deleted: (lifting hoist1 crate8)
   added: (in crate8 truck0) (available hoist1)
   goals met: 8 of 10
81. (lift hoist1 crate3 crate7 distributor0)
   deleted: (at crate3 distributor0) (available hoist1) (on crate3 crate7) (clear crate3)
   added: (lifting hoist1 crate3) (clear crate7)
   goals met: 8 of 10
82. (load hoist1 crate3 truck0 distributor0)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck0) (available hoist1)
   goals met: 8 of 10
83. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 8 of 10
84. (unload hoist2 crate3 truck0 distributor1)
   deleted: (available hoist2) (in crate3 truck0)
   added: (lifting hoist2 crate3)
   goals met: 8 of 10
85. (drop hoist2 crate3 pallet2 distributor1)
   deleted: (lifting hoist2 crate3) (clear pallet2)
   added: (at crate3 distributor1) (available hoist2) (on crate3 pallet2) (clear crate3)
   goals met: 9 of 10
86. (unload hoist2 crate8 truck0 distributor1)
   deleted: (available hoist2) (in crate8 truck0)
   added: (lifting hoist2 crate8)
   goals met: 9 of 10
87. (drop hoist2 crate8 crate3 distributor1)
   deleted: (lifting hoist2 crate8) (clear crate3)
   added: (at crate8 distributor1) (available hoist2) (on crate8 crate3) (clear crate8)
   goals met: 10 of 10
